app/controllers/posts_controller.rb

  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("updated_at", "title", "body", "created_at") VALUES('2009-02-08 02:01:02', 'Ruby Rocks!', 'It sure is.', '2009-02-08 02:01:02')

  def update
    @post = Post.find(params[:id])

    respond_to do |format|
      if @post.update_attributes(params[:post])
---
SELECT * FROM "posts" WHERE ("posts"."id" = 1)
UPDATE "posts" SET "body" = 'It sure is. Indeed!', "updated_at" = '2009-02-08 02:01:11' WHERE "id" = 1